 [
    {
      "title": "Welches Wort ergibt sich aus den Anfangsbuchstzaben der rot geschriebenen Wörtern",
      "fragen": ["In(0,0,0) der(0,0,255) hügeligen(255,0,255), idyllischen(255,255,0) Ferne(0,0,255) weit(0,0,0) weg(0,255,0) von(0,0,255) der(0,255,255) Erde(255,0,0) lebten(0,0,0) friedliche(0,255,0) Individuen(0,255,0), die(0,255,255) sich(0,0,255) liebevoll(0,255,0) um(0,255,255) ihre(0,255,0) Familie(0,0,255) und(0,255,0) ihre(0,255,0) Umwelt(0,0,255) kümmern(0,255,255), während(0,255,0) ein(0,0,255) friedlicher(255,0,0) König(0,255,255) das(0,255,0) Land(255,0,0) regiert(0,0,0) und(0,0,0) immer(0,0,0) einfallsreiche(0,0,0) Ideen(255,0,0) hat(255,0,0)."],
      "antworten": ["IWLRUIE", "DFVSFUE", "WFILIUIWD", "EFLIH"],
      "correct": 4,
      "img": "/images/prolog.svg",
      "hilfe": [
        "Die RGB-Codes sind der Schlüssel, um die versteckte Botschaft zu entschlüsseln. Hier ist ein Hinweis, wie das RGB-System funktioniert:",
        "\n\n",
        "Bei der Übertragung ist der Farb-Code verloren gegangen, daher werden die RGB-Werte hinter den Wörtern dargestellt.",
        "\n\n",
        "RGB steht für Rot, Grün und Blau, die drei grundlegenden Farben. Jeder Buchstabe in der Nachricht wird durch eine Kombination dieser Farben dargestellt. Die Zahlen in den Klammern repräsentieren die Intensität der Farben. Zum Beispiel bedeutet (255, 0, 0) volle Intensität von Rot, (0, 255, 0) volle Intensität von Grün und (0, 0, 255) volle Intensität von Blau.",
        "\n\n",
        "In der Nachricht hast du Wörter mit roten Buchstaben gesehen. Achte darauf, dass der erste Buchstabe dieser roten Wörter die eigentliche Nachricht ergibt. Der Wert des roten Kanals (erste Zahl) gibt dir den Buchstaben. Die anderen Farben sind Ablenkungen und sollen dich nicht verwirren.",
        "\n\n",
        "Bleib konzentriert, Agent! Die Slawpbewohner zählen auf dich, um ihre Nachrichten zu entschlüsseln und die Geheimnisse des Slawpplaneten zu lüften."
        ],
      "hilfeIMG": ""
    },
    {
      "title": "Übersetze in Binärcode",
      "fragen": ["Die Koordinaten des Slawpplaneten sind X: 112 Y: 86 Z: 63. Was sind die richtigen Koordinaten in Binär?"],
      "antworten": [
        ["1110000\n1010110\n0111111"], 
        ["1111000\n1010110\n0011111"],
        ["1100000\n1010111\n0111110"],
        ["1110000\n1011110\n0111111"]
      ],
      "correct": 1,
      "img": "",
      "hilfe":[
        "Wie funktioniert die Dezimal-Binär-Umwandlung?",
        "\n\n",
        "Um eine Dezimalzahl ins Binärsystem umzuwandeln, kannst du folgende Methode verwenden:",
        "\n\n",
        "1. Teile die Dezimalzahl durch 2.",
        "\n",
        "2. Notiere den Rest.",
        "\n",
        "3. Teile den Quotienten erneut durch 2.",
        "\n",
        "4. Notiere den Rest.",
        "\n",
        "5. Wiederhole diese Schritte, bis der Quotient 0 ist.",
        "\n\n",
        "Die Ziffern der Binärzahl sind dann die Reste in umgekehrter Reihenfolge.",
        "\n\n",
        "Beispiel",
        "\n\n",
        "Um die Dezimalzahl 12 ins Binärsystem umzuwandeln, gehst du wie folgt vor:",
        "\n\n",
        "1. 12 / 2 = 6 Rest 0",
        "\n",
        "2. 6 / 2 = 3 Rest 0",
        "\n",
        "3. 3 / 2 = 1 Rest 1",
        "\n",
        "4. 1 / 2 = 0 Rest 1",
        "\n\n",
        "Die Binärzahl für 12 ist also 1100.",
        "\n\n",
        "Hier weitere Beispiele",
        "\n\n",
        "Für die Zahl 24:",
        "\n\n",
        "1. 24 / 2 = 12 Rest 0",
        "\n",
        "2. 12 / 2 = 6 Rest 0",
        "\n",
        "3. 6 / 2 = 3 Rest 0",
        "\n",
        "4. 3 / 2 = 1 Rest 1",
        "\n\n",
        "Die Binärzahl für 24 ist also 1110."

      ]
    },
    {
      "title": "Wähle die richtige Antwort aus",
      "fragen": ["Welcher Code ist richtig, um die Rakete zu starten?"],
      "antworten": ["iwlruie", "dfvsfue", "wfiliuiwd", "eflih"],
      "correct": 4,
      "img": "",
      "hilfe":[
        "Stell dir vor, du möchtest in der Welt der Programmierung Dinge erschaffen, organisieren und steuern. Genau hier kommen \"Klassen\" ins Spiel. In objektorientierten Programmiersprachen sind Klassen wie Baupläne oder Schablonen, die dir helfen, bestimmte Dinge zu erstellen.",
        "\n\n",
        "Eine \"Klasse\" beschreibt, wie ein bestimmtes Objekt aussehen und sich verhalten soll. Denk daran, ein Objekt könnte alles sein - von einem Spielzeugauto bis zu einem Bankkonto in einem Computerprogramm.",
        "\n\n",
        "Jetzt lass uns tiefer in das Konzept eintauchen und einen Blick auf Klassen und Methoden werfen, um zu verstehen, wie sie zusammenarbeiten.",
        "\n",
        "Stell dir vor, du baust nicht nur ein Spielzeugauto, sondern möchtest, dass es bestimmte Dinge tun kann, wie sich bewegen oder hupen. Hier kommen die \"Methoden\" ins Spiel. In Java sind Methoden wie die speziellen Fähigkeiten oder Aufgaben, die dein Spielzeugauto ausführen kann.",
        "\n\n",
        "Schauen wir uns das Beispiel mit dem Spielzeugauto an und fügen eine Methode hinzu, die es sich bewegen lässt:",
        
        ""


      ]
    }
  ]