[
{
    "text": "",
    "img": "/images/Computer.png"

},
{
    "text": "",
    "img": "/images/H1.1.png"

},
{
    "text": "",
    "img": "/images/H1.2.png"

},
{
    "text": "Du hast die Nachricht entschlüsseln können! Es ist eine Hilferuf der Bewohner des Slawpplaneten…",
    "img": "/images/Computer2.png"

},
{
    "text": "Um mehr über die Lage herauszufinden, musst du eine Spionagedrohne zum Planeten schicken…",
    "img": "/images/Drohne.png"

},
{
    "text": "Um die Drohne erfolgreich zum Planeten zu leiten musst du die Koordinaten richtig eingeben.  Allerdings kann die Drohne nur Binär-Zahlen lesen. Übersetze die Koordinaten in Binär-Zahlen, um die Drohne zu navigieren.",
    "img": "/images/Drohne.png"

},
{
    "text": "",
    "img": "/images/H2.1.png"

},
{
    "text": "",
    "img": "/images/H2.2.png"

},

{
    "text": "Die Spionagedrohne ist erfolgreich zurückgekehrt. Die Bewohner des Slawpplaneten werden vom bösen Herrscher Gargor unterdrückt. Um die Bewohner zu befreien musst du Gargor festnehmen.",
    "img": "/images/Felder.png"

},
{
    "text": "Gargor lebt in einer Burg auf dem Slawpplaneten, die von seinen besten Soldaten bewacht wird. Um zum Slawpplaneten zu gelangen und Gargor festzunehmen, musst du eine Rakete bauen",
    "img": "/images/Gargor.png"

},
{
    "text": "",
    "img": "/images/H3.1.png"

},
{
    "text": "",
    "img": "/images/H3.2.png"

},
{
    "text": "",
    "img": "/images/H3.3.png"

},
{
    "text": "",
    "img": "/images/H3.4.png"

},
{
    "text": "Du hast es Geschafft und die Rakete ist einsatzbereit! Begebe dich jetzt auf die Mission Gargor zu fangen und die Bewohner des Slwapplaneten zu befreien",
    "img": "/images/Raumschiff.png"

},










{
    "text": "Du befindest dich auf dem Weg zum Slawpplaneten, um die Bewohner von ihrem bösen Herrscher Gargor zu befreien.",
    "img": "/images/Cockpit.png"

},
{
    "text": "Mitten in deinem Abenteuer gerätst du in einen Meteoridenschauer. Mit deinem Flugtalent entkommst du den meisten, doch einer trifft das Navigationszentrum. Um den Kurs wiederzufinden, musst du schnell die Koordinaten des Slawpplaneten eingeben. Die Reise hängt davon ab!",
    "img": "/images/Cockpit2.png"

},
{
    "text": "",
    "img": "/images/H4.1.png"

},
{
    "text": "",
    "img": "/images/H4.2.png"

},



{
    "text": "Du hast es geschafft! Du bist beim Slawpplaneten angekommen.",
    "img": "/images/Planet.png"

},
{
    "text": "Du schaffst es ungemerkt zu landen. Um zu Gargor zu kommen musst du jedoch an unzähligen Wachen vorbei. Da du im Kampf in Unterzahl währst versuchst du die Wachen abzulenken, um ungemerkt in Gargor’s Thronsaal zu kommen",
    "img": "/images/Eingang.png"

},
{
    "text": "",
    "img": "/images/H5.1.png"

},
{
    "text": "",
    "img": "/images/H5.2.png"

},



{
    "text": "Es hat funktioniert. Die Wachen maschieren alle in die falsche Richtung und verlassen ihre Positionen. Dadurch gelangst du unbemerkt in den Thronsaal",
    "img": "/images/Rennen.png"

},
{
    "text": "In dem Moment, indem du den Thronsaal betritst entwischt dir Gargor über eine versteckte Hintertür. Durch Drohnenaufnahmen findest du heraus, dass sich Gargor in den hoch-giftigen Feldern der Slawppflanzen aufhält. Da du durch das Gift die Felder nicht durchqueeren kannst musst du einen Roboter programmieren, der Gargor fängt.",
    "img": "/images/Thron.png"

},
{
    "text": "",
    "img": "/images/H6.1.png"

},
{
    "text": "",
    "img": "/images/H6.2.png"

},



{
    "text": "Herzlichen Glückwunsch Du hast Gargor gefangen genommen und die Bewohner des Slawpplaneten befreit Mit dem Gefangenen kehrst du als Sieger auf die Erde zurück",
    "img": "/images/Ende.png"

}
]